==============================================================================================================
Layer (type:depth-idx)                                       Input Shape               Output Shape
==============================================================================================================
emb_gen                                                      --                        [16, 512]
├─CTCLIP: 1-1                                                --                        [16, 512]
│    └─BertModel: 2-1                                        [16, 512]                 [16, 768]
│    │    └─BertEmbeddings: 3-1                              --                        [16, 512, 768]
│    │    │    └─Embedding: 4-1                              [16, 512]                 [16, 512, 768]
│    │    │    └─Embedding: 4-2                              [16, 512]                 [16, 512, 768]
│    │    │    └─Embedding: 4-3                              [1, 512]                  [1, 512, 768]
│    │    │    └─LayerNorm: 4-4                              [16, 512, 768]            [16, 512, 768]
│    │    │    └─Dropout: 4-5                                [16, 512, 768]            [16, 512, 768]
│    │    └─BertEncoder: 3-2                                 [16, 512, 768]            [16, 512, 768]
│    │    │    └─ModuleList: 4-6                             --                        --
│    │    │    │    └─BertLayer: 5-1                         [16, 512, 768]            [16, 512, 768]
│    │    │    │    │    └─BertAttention: 6-1                [16, 512, 768]            [16, 512, 768]
│    │    │    │    │    │    └─BertSelfAttention: 7-1       [16, 512, 768]            [16, 512, 768]
│    │    │    │    │    │    │    └─Linear: 8-1             [16, 512, 768]            [16, 512, 768]
│    │    │    │    │    │    │    └─Linear: 8-2             [16, 512, 768]            [16, 512, 768]
│    │    │    │    │    │    │    └─Linear: 8-3             [16, 512, 768]            [16, 512, 768]
│    │    │    │    │    │    │    └─Dropout: 8-4            [16, 12, 512, 512]        [16, 12, 512, 512]
│    │    │    │    │    │    └─BertSelfOutput: 7-2          [16, 512, 768]            [16, 512, 768]
│    │    │    │    │    │    │    └─Linear: 8-5             [16, 512, 768]            [16, 512, 768]
│    │    │    │    │    │    │    └─Dropout: 8-6            [16, 512, 768]            [16, 512, 768]
│    │    │    │    │    │    │    └─LayerNorm: 8-7          [16, 512, 768]            [16, 512, 768]
│    │    │    │    │    └─BertIntermediate: 6-2             [16, 512, 768]            [16, 512, 3072]
│    │    │    │    │    │    └─Linear: 7-3                  [16, 512, 768]            [16, 512, 3072]
│    │    │    │    │    │    └─GELUActivation: 7-4          [16, 512, 3072]           [16, 512, 3072]
│    │    │    │    │    └─BertOutput: 6-3                   [16, 512, 3072]           [16, 512, 768]
│    │    │    │    │    │    └─Linear: 7-5                  [16, 512, 3072]           [16, 512, 768]
│    │    │    │    │    │    └─Dropout: 7-6                 [16, 512, 768]            [16, 512, 768]
│    │    │    │    │    │    └─LayerNorm: 7-7               [16, 512, 768]            [16, 512, 768]
│    │    │    │    └─BertLayer: 5-2                         [16, 512, 768]            [16, 512, 768]
│    │    │    │    │    └─BertAttention: 6-4                [16, 512, 768]            [16, 512, 768]
│    │    │    │    │    │    └─BertSelfAttention: 7-8       [16, 512, 768]            [16, 512, 768]
│    │    │    │    │    │    │    └─Linear: 8-8             [16, 512, 768]            [16, 512, 768]
│    │    │    │    │    │    │    └─Linear: 8-9             [16, 512, 768]            [16, 512, 768]
│    │    │    │    │    │    │    └─Linear: 8-10            [16, 512, 768]            [16, 512, 768]
│    │    │    │    │    │    │    └─Dropout: 8-11           [16, 12, 512, 512]        [16, 12, 512, 512]
│    │    │    │    │    │    └─BertSelfOutput: 7-9          [16, 512, 768]            [16, 512, 768]
│    │    │    │    │    │    │    └─Linear: 8-12            [16, 512, 768]            [16, 512, 768]
│    │    │    │    │    │    │    └─Dropout: 8-13           [16, 512, 768]            [16, 512, 768]
│    │    │    │    │    │    │    └─LayerNorm: 8-14         [16, 512, 768]            [16, 512, 768]
│    │    │    │    │    └─BertIntermediate: 6-5             [16, 512, 768]            [16, 512, 3072]
│    │    │    │    │    │    └─Linear: 7-10                 [16, 512, 768]            [16, 512, 3072]
│    │    │    │    │    │    └─GELUActivation: 7-11         [16, 512, 3072]           [16, 512, 3072]
│    │    │    │    │    └─BertOutput: 6-6                   [16, 512, 3072]           [16, 512, 768]
│    │    │    │    │    │    └─Linear: 7-12                 [16, 512, 3072]           [16, 512, 768]
│    │    │    │    │    │    └─Dropout: 7-13                [16, 512, 768]            [16, 512, 768]
│    │    │    │    │    │    └─LayerNorm: 7-14              [16, 512, 768]            [16, 512, 768]
│    │    │    │    └─BertLayer: 5-3                         [16, 512, 768]            [16, 512, 768]
│    │    │    │    │    └─BertAttention: 6-7                [16, 512, 768]            [16, 512, 768]
│    │    │    │    │    │    └─BertSelfAttention: 7-15      [16, 512, 768]            [16, 512, 768]
│    │    │    │    │    │    │    └─Linear: 8-15            [16, 512, 768]            [16, 512, 768]
│    │    │    │    │    │    │    └─Linear: 8-16            [16, 512, 768]            [16, 512, 768]
│    │    │    │    │    │    │    └─Linear: 8-17            [16, 512, 768]            [16, 512, 768]
│    │    │    │    │    │    │    └─Dropout: 8-18           [16, 12, 512, 512]        [16, 12, 512, 512]
│    │    │    │    │    │    └─BertSelfOutput: 7-16         [16, 512, 768]            [16, 512, 768]
│    │    │    │    │    │    │    └─Linear: 8-19            [16, 512, 768]            [16, 512, 768]
│    │    │    │    │    │    │    └─Dropout: 8-20           [16, 512, 768]            [16, 512, 768]
│    │    │    │    │    │    │    └─LayerNorm: 8-21         [16, 512, 768]            [16, 512, 768]
│    │    │    │    │    └─BertIntermediate: 6-8             [16, 512, 768]            [16, 512, 3072]
│    │    │    │    │    │    └─Linear: 7-17                 [16, 512, 768]            [16, 512, 3072]
│    │    │    │    │    │    └─GELUActivation: 7-18         [16, 512, 3072]           [16, 512, 3072]
│    │    │    │    │    └─BertOutput: 6-9                   [16, 512, 3072]           [16, 512, 768]
│    │    │    │    │    │    └─Linear: 7-19                 [16, 512, 3072]           [16, 512, 768]
│    │    │    │    │    │    └─Dropout: 7-20                [16, 512, 768]            [16, 512, 768]
│    │    │    │    │    │    └─LayerNorm: 7-21              [16, 512, 768]            [16, 512, 768]
│    │    │    │    └─BertLayer: 5-4                         [16, 512, 768]            [16, 512, 768]
│    │    │    │    │    └─BertAttention: 6-10               [16, 512, 768]            [16, 512, 768]
│    │    │    │    │    │    └─BertSelfAttention: 7-22      [16, 512, 768]            [16, 512, 768]
│    │    │    │    │    │    │    └─Linear: 8-22            [16, 512, 768]            [16, 512, 768]
│    │    │    │    │    │    │    └─Linear: 8-23            [16, 512, 768]            [16, 512, 768]
│    │    │    │    │    │    │    └─Linear: 8-24            [16, 512, 768]            [16, 512, 768]
│    │    │    │    │    │    │    └─Dropout: 8-25           [16, 12, 512, 512]        [16, 12, 512, 512]
│    │    │    │    │    │    └─BertSelfOutput: 7-23         [16, 512, 768]            [16, 512, 768]
│    │    │    │    │    │    │    └─Linear: 8-26            [16, 512, 768]            [16, 512, 768]
│    │    │    │    │    │    │    └─Dropout: 8-27           [16, 512, 768]            [16, 512, 768]
│    │    │    │    │    │    │    └─LayerNorm: 8-28         [16, 512, 768]            [16, 512, 768]
│    │    │    │    │    └─BertIntermediate: 6-11            [16, 512, 768]            [16, 512, 3072]
│    │    │    │    │    │    └─Linear: 7-24                 [16, 512, 768]            [16, 512, 3072]
│    │    │    │    │    │    └─GELUActivation: 7-25         [16, 512, 3072]           [16, 512, 3072]
│    │    │    │    │    └─BertOutput: 6-12                  [16, 512, 3072]           [16, 512, 768]
│    │    │    │    │    │    └─Linear: 7-26                 [16, 512, 3072]           [16, 512, 768]
│    │    │    │    │    │    └─Dropout: 7-27                [16, 512, 768]            [16, 512, 768]
│    │    │    │    │    │    └─LayerNorm: 7-28              [16, 512, 768]            [16, 512, 768]
│    │    │    │    └─BertLayer: 5-5                         [16, 512, 768]            [16, 512, 768]
│    │    │    │    │    └─BertAttention: 6-13               [16, 512, 768]            [16, 512, 768]
│    │    │    │    │    │    └─BertSelfAttention: 7-29      [16, 512, 768]            [16, 512, 768]
│    │    │    │    │    │    │    └─Linear: 8-29            [16, 512, 768]            [16, 512, 768]
│    │    │    │    │    │    │    └─Linear: 8-30            [16, 512, 768]            [16, 512, 768]
│    │    │    │    │    │    │    └─Linear: 8-31            [16, 512, 768]            [16, 512, 768]
│    │    │    │    │    │    │    └─Dropout: 8-32           [16, 12, 512, 512]        [16, 12, 512, 512]
│    │    │    │    │    │    └─BertSelfOutput: 7-30         [16, 512, 768]            [16, 512, 768]
│    │    │    │    │    │    │    └─Linear: 8-33            [16, 512, 768]            [16, 512, 768]
│    │    │    │    │    │    │    └─Dropout: 8-34           [16, 512, 768]            [16, 512, 768]
│    │    │    │    │    │    │    └─LayerNorm: 8-35         [16, 512, 768]            [16, 512, 768]
│    │    │    │    │    └─BertIntermediate: 6-14            [16, 512, 768]            [16, 512, 3072]
│    │    │    │    │    │    └─Linear: 7-31                 [16, 512, 768]            [16, 512, 3072]
│    │    │    │    │    │    └─GELUActivation: 7-32         [16, 512, 3072]           [16, 512, 3072]
│    │    │    │    │    └─BertOutput: 6-15                  [16, 512, 3072]           [16, 512, 768]
│    │    │    │    │    │    └─Linear: 7-33                 [16, 512, 3072]           [16, 512, 768]
│    │    │    │    │    │    └─Dropout: 7-34                [16, 512, 768]            [16, 512, 768]
│    │    │    │    │    │    └─LayerNorm: 7-35              [16, 512, 768]            [16, 512, 768]
│    │    │    │    └─BertLayer: 5-6                         [16, 512, 768]            [16, 512, 768]
│    │    │    │    │    └─BertAttention: 6-16               [16, 512, 768]            [16, 512, 768]
│    │    │    │    │    │    └─BertSelfAttention: 7-36      [16, 512, 768]            [16, 512, 768]
│    │    │    │    │    │    │    └─Linear: 8-36            [16, 512, 768]            [16, 512, 768]
│    │    │    │    │    │    │    └─Linear: 8-37            [16, 512, 768]            [16, 512, 768]
│    │    │    │    │    │    │    └─Linear: 8-38            [16, 512, 768]            [16, 512, 768]
│    │    │    │    │    │    │    └─Dropout: 8-39           [16, 12, 512, 512]        [16, 12, 512, 512]
│    │    │    │    │    │    └─BertSelfOutput: 7-37         [16, 512, 768]            [16, 512, 768]
│    │    │    │    │    │    │    └─Linear: 8-40            [16, 512, 768]            [16, 512, 768]
│    │    │    │    │    │    │    └─Dropout: 8-41           [16, 512, 768]            [16, 512, 768]
│    │    │    │    │    │    │    └─LayerNorm: 8-42         [16, 512, 768]            [16, 512, 768]
│    │    │    │    │    └─BertIntermediate: 6-17            [16, 512, 768]            [16, 512, 3072]
│    │    │    │    │    │    └─Linear: 7-38                 [16, 512, 768]            [16, 512, 3072]
│    │    │    │    │    │    └─GELUActivation: 7-39         [16, 512, 3072]           [16, 512, 3072]
│    │    │    │    │    └─BertOutput: 6-18                  [16, 512, 3072]           [16, 512, 768]
│    │    │    │    │    │    └─Linear: 7-40                 [16, 512, 3072]           [16, 512, 768]
│    │    │    │    │    │    └─Dropout: 7-41                [16, 512, 768]            [16, 512, 768]
│    │    │    │    │    │    └─LayerNorm: 7-42              [16, 512, 768]            [16, 512, 768]
│    │    │    │    └─BertLayer: 5-7                         [16, 512, 768]            [16, 512, 768]
│    │    │    │    │    └─BertAttention: 6-19               [16, 512, 768]            [16, 512, 768]
│    │    │    │    │    │    └─BertSelfAttention: 7-43      [16, 512, 768]            [16, 512, 768]
│    │    │    │    │    │    │    └─Linear: 8-43            [16, 512, 768]            [16, 512, 768]
│    │    │    │    │    │    │    └─Linear: 8-44            [16, 512, 768]            [16, 512, 768]
│    │    │    │    │    │    │    └─Linear: 8-45            [16, 512, 768]            [16, 512, 768]
│    │    │    │    │    │    │    └─Dropout: 8-46           [16, 12, 512, 512]        [16, 12, 512, 512]
│    │    │    │    │    │    └─BertSelfOutput: 7-44         [16, 512, 768]            [16, 512, 768]
│    │    │    │    │    │    │    └─Linear: 8-47            [16, 512, 768]            [16, 512, 768]
│    │    │    │    │    │    │    └─Dropout: 8-48           [16, 512, 768]            [16, 512, 768]
│    │    │    │    │    │    │    └─LayerNorm: 8-49         [16, 512, 768]            [16, 512, 768]
│    │    │    │    │    └─BertIntermediate: 6-20            [16, 512, 768]            [16, 512, 3072]
│    │    │    │    │    │    └─Linear: 7-45                 [16, 512, 768]            [16, 512, 3072]
│    │    │    │    │    │    └─GELUActivation: 7-46         [16, 512, 3072]           [16, 512, 3072]
│    │    │    │    │    └─BertOutput: 6-21                  [16, 512, 3072]           [16, 512, 768]
│    │    │    │    │    │    └─Linear: 7-47                 [16, 512, 3072]           [16, 512, 768]
│    │    │    │    │    │    └─Dropout: 7-48                [16, 512, 768]            [16, 512, 768]
│    │    │    │    │    │    └─LayerNorm: 7-49              [16, 512, 768]            [16, 512, 768]
│    │    │    │    └─BertLayer: 5-8                         [16, 512, 768]            [16, 512, 768]
│    │    │    │    │    └─BertAttention: 6-22               [16, 512, 768]            [16, 512, 768]
│    │    │    │    │    │    └─BertSelfAttention: 7-50      [16, 512, 768]            [16, 512, 768]
│    │    │    │    │    │    │    └─Linear: 8-50            [16, 512, 768]            [16, 512, 768]
│    │    │    │    │    │    │    └─Linear: 8-51            [16, 512, 768]            [16, 512, 768]
│    │    │    │    │    │    │    └─Linear: 8-52            [16, 512, 768]            [16, 512, 768]
│    │    │    │    │    │    │    └─Dropout: 8-53           [16, 12, 512, 512]        [16, 12, 512, 512]
│    │    │    │    │    │    └─BertSelfOutput: 7-51         [16, 512, 768]            [16, 512, 768]
│    │    │    │    │    │    │    └─Linear: 8-54            [16, 512, 768]            [16, 512, 768]
│    │    │    │    │    │    │    └─Dropout: 8-55           [16, 512, 768]            [16, 512, 768]
│    │    │    │    │    │    │    └─LayerNorm: 8-56         [16, 512, 768]            [16, 512, 768]
│    │    │    │    │    └─BertIntermediate: 6-23            [16, 512, 768]            [16, 512, 3072]
│    │    │    │    │    │    └─Linear: 7-52                 [16, 512, 768]            [16, 512, 3072]
│    │    │    │    │    │    └─GELUActivation: 7-53         [16, 512, 3072]           [16, 512, 3072]
│    │    │    │    │    └─BertOutput: 6-24                  [16, 512, 3072]           [16, 512, 768]
│    │    │    │    │    │    └─Linear: 7-54                 [16, 512, 3072]           [16, 512, 768]
│    │    │    │    │    │    └─Dropout: 7-55                [16, 512, 768]            [16, 512, 768]
│    │    │    │    │    │    └─LayerNorm: 7-56              [16, 512, 768]            [16, 512, 768]
│    │    │    │    └─BertLayer: 5-9                         [16, 512, 768]            [16, 512, 768]
│    │    │    │    │    └─BertAttention: 6-25               [16, 512, 768]            [16, 512, 768]
│    │    │    │    │    │    └─BertSelfAttention: 7-57      [16, 512, 768]            [16, 512, 768]
│    │    │    │    │    │    │    └─Linear: 8-57            [16, 512, 768]            [16, 512, 768]
│    │    │    │    │    │    │    └─Linear: 8-58            [16, 512, 768]            [16, 512, 768]
│    │    │    │    │    │    │    └─Linear: 8-59            [16, 512, 768]            [16, 512, 768]
│    │    │    │    │    │    │    └─Dropout: 8-60           [16, 12, 512, 512]        [16, 12, 512, 512]
│    │    │    │    │    │    └─BertSelfOutput: 7-58         [16, 512, 768]            [16, 512, 768]
│    │    │    │    │    │    │    └─Linear: 8-61            [16, 512, 768]            [16, 512, 768]
│    │    │    │    │    │    │    └─Dropout: 8-62           [16, 512, 768]            [16, 512, 768]
│    │    │    │    │    │    │    └─LayerNorm: 8-63         [16, 512, 768]            [16, 512, 768]
│    │    │    │    │    └─BertIntermediate: 6-26            [16, 512, 768]            [16, 512, 3072]
│    │    │    │    │    │    └─Linear: 7-59                 [16, 512, 768]            [16, 512, 3072]
│    │    │    │    │    │    └─GELUActivation: 7-60         [16, 512, 3072]           [16, 512, 3072]
│    │    │    │    │    └─BertOutput: 6-27                  [16, 512, 3072]           [16, 512, 768]
│    │    │    │    │    │    └─Linear: 7-61                 [16, 512, 3072]           [16, 512, 768]
│    │    │    │    │    │    └─Dropout: 7-62                [16, 512, 768]            [16, 512, 768]
│    │    │    │    │    │    └─LayerNorm: 7-63              [16, 512, 768]            [16, 512, 768]
│    │    │    │    └─BertLayer: 5-10                        [16, 512, 768]            [16, 512, 768]
│    │    │    │    │    └─BertAttention: 6-28               [16, 512, 768]            [16, 512, 768]
│    │    │    │    │    │    └─BertSelfAttention: 7-64      [16, 512, 768]            [16, 512, 768]
│    │    │    │    │    │    │    └─Linear: 8-64            [16, 512, 768]            [16, 512, 768]
│    │    │    │    │    │    │    └─Linear: 8-65            [16, 512, 768]            [16, 512, 768]
│    │    │    │    │    │    │    └─Linear: 8-66            [16, 512, 768]            [16, 512, 768]
│    │    │    │    │    │    │    └─Dropout: 8-67           [16, 12, 512, 512]        [16, 12, 512, 512]
│    │    │    │    │    │    └─BertSelfOutput: 7-65         [16, 512, 768]            [16, 512, 768]
│    │    │    │    │    │    │    └─Linear: 8-68            [16, 512, 768]            [16, 512, 768]
│    │    │    │    │    │    │    └─Dropout: 8-69           [16, 512, 768]            [16, 512, 768]
│    │    │    │    │    │    │    └─LayerNorm: 8-70         [16, 512, 768]            [16, 512, 768]
│    │    │    │    │    └─BertIntermediate: 6-29            [16, 512, 768]            [16, 512, 3072]
│    │    │    │    │    │    └─Linear: 7-66                 [16, 512, 768]            [16, 512, 3072]
│    │    │    │    │    │    └─GELUActivation: 7-67         [16, 512, 3072]           [16, 512, 3072]
│    │    │    │    │    └─BertOutput: 6-30                  [16, 512, 3072]           [16, 512, 768]
│    │    │    │    │    │    └─Linear: 7-68                 [16, 512, 3072]           [16, 512, 768]
│    │    │    │    │    │    └─Dropout: 7-69                [16, 512, 768]            [16, 512, 768]
│    │    │    │    │    │    └─LayerNorm: 7-70              [16, 512, 768]            [16, 512, 768]
│    │    │    │    └─BertLayer: 5-11                        [16, 512, 768]            [16, 512, 768]
│    │    │    │    │    └─BertAttention: 6-31               [16, 512, 768]            [16, 512, 768]
│    │    │    │    │    │    └─BertSelfAttention: 7-71      [16, 512, 768]            [16, 512, 768]
│    │    │    │    │    │    │    └─Linear: 8-71            [16, 512, 768]            [16, 512, 768]
│    │    │    │    │    │    │    └─Linear: 8-72            [16, 512, 768]            [16, 512, 768]
│    │    │    │    │    │    │    └─Linear: 8-73            [16, 512, 768]            [16, 512, 768]
│    │    │    │    │    │    │    └─Dropout: 8-74           [16, 12, 512, 512]        [16, 12, 512, 512]
│    │    │    │    │    │    └─BertSelfOutput: 7-72         [16, 512, 768]            [16, 512, 768]
│    │    │    │    │    │    │    └─Linear: 8-75            [16, 512, 768]            [16, 512, 768]
│    │    │    │    │    │    │    └─Dropout: 8-76           [16, 512, 768]            [16, 512, 768]
│    │    │    │    │    │    │    └─LayerNorm: 8-77         [16, 512, 768]            [16, 512, 768]
│    │    │    │    │    └─BertIntermediate: 6-32            [16, 512, 768]            [16, 512, 3072]
│    │    │    │    │    │    └─Linear: 7-73                 [16, 512, 768]            [16, 512, 3072]
│    │    │    │    │    │    └─GELUActivation: 7-74         [16, 512, 3072]           [16, 512, 3072]
│    │    │    │    │    └─BertOutput: 6-33                  [16, 512, 3072]           [16, 512, 768]
│    │    │    │    │    │    └─Linear: 7-75                 [16, 512, 3072]           [16, 512, 768]
│    │    │    │    │    │    └─Dropout: 7-76                [16, 512, 768]            [16, 512, 768]
│    │    │    │    │    │    └─LayerNorm: 7-77              [16, 512, 768]            [16, 512, 768]
│    │    │    │    └─BertLayer: 5-12                        [16, 512, 768]            [16, 512, 768]
│    │    │    │    │    └─BertAttention: 6-34               [16, 512, 768]            [16, 512, 768]
│    │    │    │    │    │    └─BertSelfAttention: 7-78      [16, 512, 768]            [16, 512, 768]
│    │    │    │    │    │    │    └─Linear: 8-78            [16, 512, 768]            [16, 512, 768]
│    │    │    │    │    │    │    └─Linear: 8-79            [16, 512, 768]            [16, 512, 768]
│    │    │    │    │    │    │    └─Linear: 8-80            [16, 512, 768]            [16, 512, 768]
│    │    │    │    │    │    │    └─Dropout: 8-81           [16, 12, 512, 512]        [16, 12, 512, 512]
│    │    │    │    │    │    └─BertSelfOutput: 7-79         [16, 512, 768]            [16, 512, 768]
│    │    │    │    │    │    │    └─Linear: 8-82            [16, 512, 768]            [16, 512, 768]
│    │    │    │    │    │    │    └─Dropout: 8-83           [16, 512, 768]            [16, 512, 768]
│    │    │    │    │    │    │    └─LayerNorm: 8-84         [16, 512, 768]            [16, 512, 768]
│    │    │    │    │    └─BertIntermediate: 6-35            [16, 512, 768]            [16, 512, 3072]
│    │    │    │    │    │    └─Linear: 7-80                 [16, 512, 768]            [16, 512, 3072]
│    │    │    │    │    │    └─GELUActivation: 7-81         [16, 512, 3072]           [16, 512, 3072]
│    │    │    │    │    └─BertOutput: 6-36                  [16, 512, 3072]           [16, 512, 768]
│    │    │    │    │    │    └─Linear: 7-82                 [16, 512, 3072]           [16, 512, 768]
│    │    │    │    │    │    └─Dropout: 7-83                [16, 512, 768]            [16, 512, 768]
│    │    │    │    │    │    └─LayerNorm: 7-84              [16, 512, 768]            [16, 512, 768]
│    │    └─BertPooler: 3-3                                  [16, 512, 768]            [16, 768]
│    │    │    └─Linear: 4-7                                 [16, 768]                 [16, 768]
│    │    │    └─Tanh: 4-8                                   [16, 768]                 [16, 768]
│    └─CTViT: 2-2                                            [16, 1, 240, 480, 480]    [16, 24, 24, 24, 512]
│    │    └─Sequential: 3-4                                  [16, 1, 240, 480, 480]    [16, 24, 24, 24, 512]
│    │    │    └─Rearrange: 4-9                              [16, 1, 240, 480, 480]    [16, 24, 24, 24, 4000]
│    │    │    └─LayerNorm: 4-10                             [16, 24, 24, 24, 4000]    [16, 24, 24, 24, 4000]
│    │    │    └─Linear: 4-11                                [16, 24, 24, 24, 4000]    [16, 24, 24, 24, 512]
│    │    │    └─LayerNorm: 4-12                             [16, 24, 24, 24, 512]     [16, 24, 24, 24, 512]
│    │    └─ContinuousPositionBias: 3-5                      --                        [8, 576, 576]
│    │    │    └─ModuleList: 4-13                            --                        --
│    │    │    │    └─Sequential: 5-13                       [576, 576, 2]             [576, 576, 512]
│    │    │    │    │    └─Linear: 6-37                      [576, 576, 2]             [576, 576, 512]
│    │    │    │    │    └─LeakyReLU: 6-38                   [576, 576, 512]           [576, 576, 512]
│    │    │    │    └─Sequential: 5-14                       [576, 576, 512]           [576, 576, 512]
│    │    │    │    │    └─Linear: 6-39                      [576, 576, 512]           [576, 576, 512]
│    │    │    │    │    └─LeakyReLU: 6-40                   [576, 576, 512]           [576, 576, 512]
│    │    │    │    └─Linear: 5-15                           [576, 576, 512]           [576, 576, 8]
│    │    └─Transformer: 3-6                                 [384, 576, 512]           [384, 576, 512]
│    │    │    └─ModuleList: 4-14                            --                        --
│    │    │    │    └─ModuleList: 5-16                       --                        --
│    │    │    │    │    └─PEG: 6-41                         [384, 576, 512]           [384, 576, 512]
│    │    │    │    │    │    └─Conv3d: 7-85                 [16, 512, 26, 26, 26]     [16, 512, 24, 24, 24]
│    │    │    │    │    └─Attention: 6-42                   [384, 576, 512]           [384, 576, 512]
│    │    │    │    │    │    └─LayerNorm: 7-86              [384, 576, 512]           [384, 576, 512]
│    │    │    │    │    │    └─Linear: 7-87                 [384, 576, 512]           [384, 576, 256]
│    │    │    │    │    │    └─Linear: 7-88                 [384, 576, 512]           [384, 576, 512]
│    │    │    │    │    │    └─Dropout: 7-89                [384, 8, 576, 576]        [384, 8, 576, 576]
│    │    │    │    │    │    └─Linear: 7-90                 [384, 576, 256]           [384, 576, 512]
│    │    │    │    │    └─Sequential: 6-43                  [384, 576, 512]           [384, 576, 512]
│    │    │    │    │    │    └─LayerNorm: 7-91              [384, 576, 512]           [384, 576, 512]
│    │    │    │    │    │    └─Linear: 7-92                 [384, 576, 512]           [384, 576, 2730]
│    │    │    │    │    │    └─GEGLU: 7-93                  [384, 576, 2730]          [384, 576, 1365]
│    │    │    │    │    │    └─Dropout: 7-94                [384, 576, 1365]          [384, 576, 1365]
│    │    │    │    │    │    └─Linear: 7-95                 [384, 576, 1365]          [384, 576, 512]
│    │    │    │    └─ModuleList: 5-17                       --                        --
│    │    │    │    │    └─PEG: 6-44                         [384, 576, 512]           [384, 576, 512]
│    │    │    │    │    │    └─Conv3d: 7-96                 [16, 512, 26, 26, 26]     [16, 512, 24, 24, 24]
│    │    │    │    │    └─Attention: 6-45                   [384, 576, 512]           [384, 576, 512]
│    │    │    │    │    │    └─LayerNorm: 7-97              [384, 576, 512]           [384, 576, 512]
│    │    │    │    │    │    └─Linear: 7-98                 [384, 576, 512]           [384, 576, 256]
│    │    │    │    │    │    └─Linear: 7-99                 [384, 576, 512]           [384, 576, 512]
│    │    │    │    │    │    └─Dropout: 7-100               [384, 8, 576, 576]        [384, 8, 576, 576]
│    │    │    │    │    │    └─Linear: 7-101                [384, 576, 256]           [384, 576, 512]
│    │    │    │    │    └─Sequential: 6-46                  [384, 576, 512]           [384, 576, 512]
│    │    │    │    │    │    └─LayerNorm: 7-102             [384, 576, 512]           [384, 576, 512]
│    │    │    │    │    │    └─Linear: 7-103                [384, 576, 512]           [384, 576, 2730]
│    │    │    │    │    │    └─GEGLU: 7-104                 [384, 576, 2730]          [384, 576, 1365]
│    │    │    │    │    │    └─Dropout: 7-105               [384, 576, 1365]          [384, 576, 1365]
│    │    │    │    │    │    └─Linear: 7-106                [384, 576, 1365]          [384, 576, 512]
│    │    │    │    └─ModuleList: 5-18                       --                        --
│    │    │    │    │    └─PEG: 6-47                         [384, 576, 512]           [384, 576, 512]
│    │    │    │    │    │    └─Conv3d: 7-107                [16, 512, 26, 26, 26]     [16, 512, 24, 24, 24]
│    │    │    │    │    └─Attention: 6-48                   [384, 576, 512]           [384, 576, 512]
│    │    │    │    │    │    └─LayerNorm: 7-108             [384, 576, 512]           [384, 576, 512]
│    │    │    │    │    │    └─Linear: 7-109                [384, 576, 512]           [384, 576, 256]
│    │    │    │    │    │    └─Linear: 7-110                [384, 576, 512]           [384, 576, 512]
│    │    │    │    │    │    └─Dropout: 7-111               [384, 8, 576, 576]        [384, 8, 576, 576]
│    │    │    │    │    │    └─Linear: 7-112                [384, 576, 256]           [384, 576, 512]
│    │    │    │    │    └─Sequential: 6-49                  [384, 576, 512]           [384, 576, 512]
│    │    │    │    │    │    └─LayerNorm: 7-113             [384, 576, 512]           [384, 576, 512]
│    │    │    │    │    │    └─Linear: 7-114                [384, 576, 512]           [384, 576, 2730]
│    │    │    │    │    │    └─GEGLU: 7-115                 [384, 576, 2730]          [384, 576, 1365]
│    │    │    │    │    │    └─Dropout: 7-116               [384, 576, 1365]          [384, 576, 1365]
│    │    │    │    │    │    └─Linear: 7-117                [384, 576, 1365]          [384, 576, 512]
│    │    │    │    └─ModuleList: 5-19                       --                        --
│    │    │    │    │    └─PEG: 6-50                         [384, 576, 512]           [384, 576, 512]
│    │    │    │    │    │    └─Conv3d: 7-118                [16, 512, 26, 26, 26]     [16, 512, 24, 24, 24]
│    │    │    │    │    └─Attention: 6-51                   [384, 576, 512]           [384, 576, 512]
│    │    │    │    │    │    └─LayerNorm: 7-119             [384, 576, 512]           [384, 576, 512]
│    │    │    │    │    │    └─Linear: 7-120                [384, 576, 512]           [384, 576, 256]
│    │    │    │    │    │    └─Linear: 7-121                [384, 576, 512]           [384, 576, 512]
│    │    │    │    │    │    └─Dropout: 7-122               [384, 8, 576, 576]        [384, 8, 576, 576]
│    │    │    │    │    │    └─Linear: 7-123                [384, 576, 256]           [384, 576, 512]
│    │    │    │    │    └─Sequential: 6-52                  [384, 576, 512]           [384, 576, 512]
│    │    │    │    │    │    └─LayerNorm: 7-124             [384, 576, 512]           [384, 576, 512]
│    │    │    │    │    │    └─Linear: 7-125                [384, 576, 512]           [384, 576, 2730]
│    │    │    │    │    │    └─GEGLU: 7-126                 [384, 576, 2730]          [384, 576, 1365]
│    │    │    │    │    │    └─Dropout: 7-127               [384, 576, 1365]          [384, 576, 1365]
│    │    │    │    │    │    └─Linear: 7-128                [384, 576, 1365]          [384, 576, 512]
│    │    │    └─LayerNorm: 4-15                             [384, 576, 512]           [384, 576, 512]
│    │    └─Transformer: 3-7                                 [9216, 24, 512]           [9216, 24, 512]
│    │    │    └─ModuleList: 4-16                            --                        --
│    │    │    │    └─ModuleList: 5-20                       --                        --
│    │    │    │    │    └─PEG: 6-53                         [9216, 24, 512]           [9216, 24, 512]
│    │    │    │    │    │    └─Conv3d: 7-129                [16, 512, 26, 26, 26]     [16, 512, 24, 24, 24]
│    │    │    │    │    └─Attention: 6-54                   [9216, 24, 512]           [9216, 24, 512]
│    │    │    │    │    │    └─LayerNorm: 7-130             [9216, 24, 512]           [9216, 24, 512]
│    │    │    │    │    │    └─Linear: 7-131                [9216, 24, 512]           [9216, 24, 256]
│    │    │    │    │    │    └─Linear: 7-132                [9216, 24, 512]           [9216, 24, 512]
│    │    │    │    │    │    └─Dropout: 7-133               [9216, 8, 24, 24]         [9216, 8, 24, 24]
│    │    │    │    │    │    └─Linear: 7-134                [9216, 24, 256]           [9216, 24, 512]
│    │    │    │    │    └─Sequential: 6-55                  [9216, 24, 512]           [9216, 24, 512]
│    │    │    │    │    │    └─LayerNorm: 7-135             [9216, 24, 512]           [9216, 24, 512]
│    │    │    │    │    │    └─Linear: 7-136                [9216, 24, 512]           [9216, 24, 2730]
│    │    │    │    │    │    └─GEGLU: 7-137                 [9216, 24, 2730]          [9216, 24, 1365]
│    │    │    │    │    │    └─Dropout: 7-138               [9216, 24, 1365]          [9216, 24, 1365]
│    │    │    │    │    │    └─Linear: 7-139                [9216, 24, 1365]          [9216, 24, 512]
│    │    │    │    └─ModuleList: 5-21                       --                        --
│    │    │    │    │    └─PEG: 6-56                         [9216, 24, 512]           [9216, 24, 512]
│    │    │    │    │    │    └─Conv3d: 7-140                [16, 512, 26, 26, 26]     [16, 512, 24, 24, 24]
│    │    │    │    │    └─Attention: 6-57                   [9216, 24, 512]           [9216, 24, 512]
│    │    │    │    │    │    └─LayerNorm: 7-141             [9216, 24, 512]           [9216, 24, 512]
│    │    │    │    │    │    └─Linear: 7-142                [9216, 24, 512]           [9216, 24, 256]
│    │    │    │    │    │    └─Linear: 7-143                [9216, 24, 512]           [9216, 24, 512]
│    │    │    │    │    │    └─Dropout: 7-144               [9216, 8, 24, 24]         [9216, 8, 24, 24]
│    │    │    │    │    │    └─Linear: 7-145                [9216, 24, 256]           [9216, 24, 512]
│    │    │    │    │    └─Sequential: 6-58                  [9216, 24, 512]           [9216, 24, 512]
│    │    │    │    │    │    └─LayerNorm: 7-146             [9216, 24, 512]           [9216, 24, 512]
│    │    │    │    │    │    └─Linear: 7-147                [9216, 24, 512]           [9216, 24, 2730]
│    │    │    │    │    │    └─GEGLU: 7-148                 [9216, 24, 2730]          [9216, 24, 1365]
│    │    │    │    │    │    └─Dropout: 7-149               [9216, 24, 1365]          [9216, 24, 1365]
│    │    │    │    │    │    └─Linear: 7-150                [9216, 24, 1365]          [9216, 24, 512]
│    │    │    │    └─ModuleList: 5-22                       --                        --
│    │    │    │    │    └─PEG: 6-59                         [9216, 24, 512]           [9216, 24, 512]
│    │    │    │    │    │    └─Conv3d: 7-151                [16, 512, 26, 26, 26]     [16, 512, 24, 24, 24]
│    │    │    │    │    └─Attention: 6-60                   [9216, 24, 512]           [9216, 24, 512]
│    │    │    │    │    │    └─LayerNorm: 7-152             [9216, 24, 512]           [9216, 24, 512]
│    │    │    │    │    │    └─Linear: 7-153                [9216, 24, 512]           [9216, 24, 256]
│    │    │    │    │    │    └─Linear: 7-154                [9216, 24, 512]           [9216, 24, 512]
│    │    │    │    │    │    └─Dropout: 7-155               [9216, 8, 24, 24]         [9216, 8, 24, 24]
│    │    │    │    │    │    └─Linear: 7-156                [9216, 24, 256]           [9216, 24, 512]
│    │    │    │    │    └─Sequential: 6-61                  [9216, 24, 512]           [9216, 24, 512]
│    │    │    │    │    │    └─LayerNorm: 7-157             [9216, 24, 512]           [9216, 24, 512]
│    │    │    │    │    │    └─Linear: 7-158                [9216, 24, 512]           [9216, 24, 2730]
│    │    │    │    │    │    └─GEGLU: 7-159                 [9216, 24, 2730]          [9216, 24, 1365]
│    │    │    │    │    │    └─Dropout: 7-160               [9216, 24, 1365]          [9216, 24, 1365]
│    │    │    │    │    │    └─Linear: 7-161                [9216, 24, 1365]          [9216, 24, 512]
│    │    │    │    └─ModuleList: 5-23                       --                        --
│    │    │    │    │    └─PEG: 6-62                         [9216, 24, 512]           [9216, 24, 512]
│    │    │    │    │    │    └─Conv3d: 7-162                [16, 512, 26, 26, 26]     [16, 512, 24, 24, 24]
│    │    │    │    │    └─Attention: 6-63                   [9216, 24, 512]           [9216, 24, 512]
│    │    │    │    │    │    └─LayerNorm: 7-163             [9216, 24, 512]           [9216, 24, 512]
│    │    │    │    │    │    └─Linear: 7-164                [9216, 24, 512]           [9216, 24, 256]
│    │    │    │    │    │    └─Linear: 7-165                [9216, 24, 512]           [9216, 24, 512]
│    │    │    │    │    │    └─Dropout: 7-166               [9216, 8, 24, 24]         [9216, 8, 24, 24]
│    │    │    │    │    │    └─Linear: 7-167                [9216, 24, 256]           [9216, 24, 512]
│    │    │    │    │    └─Sequential: 6-64                  [9216, 24, 512]           [9216, 24, 512]
│    │    │    │    │    │    └─LayerNorm: 7-168             [9216, 24, 512]           [9216, 24, 512]
│    │    │    │    │    │    └─Linear: 7-169                [9216, 24, 512]           [9216, 24, 2730]
│    │    │    │    │    │    └─GEGLU: 7-170                 [9216, 24, 2730]          [9216, 24, 1365]
│    │    │    │    │    │    └─Dropout: 7-171               [9216, 24, 1365]          [9216, 24, 1365]
│    │    │    │    │    │    └─Linear: 7-172                [9216, 24, 1365]          [9216, 24, 512]
│    │    │    └─LayerNorm: 4-17                             [9216, 24, 512]           [9216, 24, 512]
│    │    └─VectorQuantize: 3-8                              [16, 13824, 512]          [16, 13824, 512]
│    │    │    └─Identity: 4-18                              [16, 13824, 512]          [16, 13824, 512]
│    │    │    └─CosineSimCodebook: 4-19                     [16, 13824, 512]          [16, 13824, 512]
│    │    │    └─Identity: 4-20                              [16, 13824, 512]          [16, 13824, 512]
│    └─Linear: 2-3                                           [16, 768]                 [16, 512]
│    └─Linear: 2-4                                           [16, 294912]              [16, 512]
==============================================================================================================
Total params: 438,148,761
Trainable params: 438,148,761
Non-trainable params: 0
Total mult-adds (G): 130.41
==============================================================================================================
Input size (MB): 3539.14
Forward/backward pass size (MB): 105994.75
Params size (MB): 1137.17
Estimated Total Size (MB): 110671.06
==============================================================================================================